
function [y,y1,y2]=yangtiao(a)

x=[0.52,3.1,8,17.95,28.65,39.62,50.65,78,104.6,156.6,208.6,260.7,312.5,364.4,416.3,468,494,507,520];
f=[5.288,9.4,13.84,20.2,24.9,28.44,31.1,35,36.9,36.6,34.6,31,26.34,20.9,14.8,7.8,3.7,1.5,0.2];

% x=[-1:0.1:1];
% f=1./(1+25.*x.^2);

% for i=1:21
%     x(i)=-1+(i-1)*0.1;
%     f(i)=1/(1+25*x(i)*x(i));
% end
%下面先来计算d，
%先算出f[xi,xi+1],但此时需要换一个字母，就用g代替
zt=length(x);

for i=1:zt-1
    h(i)=x(i+1)-x(i);
end
for i=1:zt-2
    u(i)=h(i+1)/(h(i+1)+h(i));
    l(i)=1-u(i);
end
    
for i=1:zt-1
    g(i)=(f(i+1)-f(i))/(x(i+1)-x(i));
end

for i=1:zt-2
    d(i)=3*(u(i)*g(i)+l(i)*g(i+1));
end

m0=1.86548;
mzt=-0.046115;

% m0=50/(26)^2;
% mzt=-50/(26)^2;

A=zeros(zt-2,zt-2);
for i=1:zt-2
    A(i,i)=2;
end

for i=1:zt-3
    A(i+1,i)=u(i+1);
    A(i,i+1)=l(i);
end

b=zeros(zt-2,1);
b(1)=d(1)-u(1)*m0;
b(zt-2)=d(zt-2)-l(zt-2)*mzt;

for i=2:1:zt-3
    b(i)=d(i);
end

M=gaosixiaoqu(A,b,zt-2);
m=zeros(zt,1);
m(1)=m0;
m(zt)=mzt;
for i=1:zt-2
    m(i+1)=M(i);
end
%m=ones(21,1);
% if (round(10*a)-10*a==0)
%     y=f(10*a+11);
% else
x(zt+1)=a;
x_order=sortrows(x);
t=find(x_order==a);
t=t-1;

y=0;
y=f(t)*(1+2*(a-x(t))/(x(t+1)-x(t)))*((a-x(t+1))/(x(t)-x(t+1)))^2;
y=y+f(t+1)*(1+2*(a-x(t+1))/(x(t)-x(t+1)))*((a-x(t))/(x(t+1)-x(t)))^2;
y=y+m(t)*(a-x(t))*((a-x(t+1))/(x(t)-x(t+1)))^2;
y=y+m(t+1)*(a-x(t+1))*((a-x(t))/(x(t+1)-x(t)))^2;

y1=0;
y1=f(t)*(2/(x(t+1)-x(t))*((a-x(t+1))/(x(t)-x(t+1)))^2-2/(x(t+1)-x(t))*(1+2*(a-x(t))/(x(t+1)-x(t)))*(a-x(t+1))/(x(t)-x(t+1)));
y1=y1+f(t+1)*(2/(x(t)-x(t+1))*((a-x(t))/(x(t+1)-x(t)))^2-2/(x(t)-x(t+1))*(1+2*(a-x(t+1))/(x(t)-x(t+1)))*(a-x(t))/(x(t+1)-x(t)));
y1=y1+m(t)*(((a-x(t+1))/(x(t)-x(t+1)))^2+2*(a-x(t))/(x(t)-x(t+1))*(a-x(t+1))/(x(t)-x(t+1)));
y1=y1+m(t+1)*(((a-x(t))/(x(t+1)-x(t)))^2+2*(a-x(t+1))/(x(t+1)-x(t))*(a-x(t))/(x(t+1)-x(t)));

y2=0;
y2=f(t)*(8*(a-x(t+1))/(x(t+1)-x(t))^3+2/(x(t+1)-x(t))+4*(a-x(t))/(x(t+1)-x(t))^3);
y2=y2+f(t+1)*(8*(a-x(t))/(x(t)-x(t+1))^3+2/(x(t)-x(t+1))+4*(a-x(t+1))/(x(t)-x(t+1))^3);
y2=y2+m(t)*(4*(a-x(t+1))/(x(t+1)-x(t))^2+2*(a-x(t))/(x(t+1)-x(t))^2);
y2=y2+m(t+1)*(4*(a-x(t))/(x(t)-x(t+1))^2+2*(a-x(t+1))/(x(t)-x(t+1))^2);

% end
